#+STARTUP: align shrink indent

**[[https://aguadopd.github.io/coursera-ml-ng/][VER NOTAS EN HTML AQUÍ]]**

Notas y ejercicios de mi paso por el curso de *Machine Learning* de Andrew Ng en Coursera. https://www.coursera.org/learn/machine-learning . Hago estas notas durante el curso para facilitar mi aprendizaje. Las comparto por si llegan a ser útiles para otros; seguramente serán útiles para mi yo del futuro. Las hago en español porque en internet suele haber menos contenido técnico en español que en inglés, y el idioma es una barrera para el aprendizaje.


El código fuente de estas notas está (/al menos hoy/) en https://github.com/aguadopd/coursera-ml-ng . Probablemente suba mis ejercicios a este repositorio también, pero deberé encriptarlos para no violar el código de honor.

Escribí todo en [[https://orgmode.org/][Org-mode]] en [[https://www.gnu.org/software/emacs/][Emacs]] ([[https://www.spacemacs.org/][Spacemacs]]). Estoy experimentando con esto. Exporté todo a HTML y hoy vive en línea gracias al hosting gratuito de https://pages.github.com/ .

El curso me pareció una buena introducción a algunos temas principales del /machine learning/. No ahondó en formalismos matemáticos, y quizás faltaron cuestiones prácticas de implementación. Aún así, vimos la esencia detrás de los algoritmos y tuvimos ejercicios varios en Octave/Matlab, para poner en práctica lo que ibamos aprendiendo.

Realizado durante el 2020, año de la ¿primera? gran cuarentena por el COVID-19. Lo hice con algunos amigos de ZA: [[https://github.com/aelkin/ml-ng-course][Alan]], Rodri, y Rocío que nos acompañó un buen trecho.

Compartido todo bajo [[https://creativecommons.org/licenses/by/4.0/legalcode][CC BY 4.0]]

* Log simple

/El tiempo sugerido oficialmente para el curso es de 6 horas por semana. Yo, sin embargo, nececesité aproximadamente 7 horas por semana (media absoluta). En realidad, las primeras semanas me llevaron casi 10 horas cada una, mientras que las últimas fueron más rápidas/.
/Este es el tiempo durante el curso. Luego le dedicaré más tiempo a repasar y completar algunas cosas que me quedaron pendientes. No sé si las registre acá/.

| Fecha            | Horas | Actividad                                                                    |   | Notas |
|                  |       | <20>                                                                         |   |       |
|------------------+-------+------------------------------------------------------------------------------+---+-------|
| [2020-03-29 dom] | 01:00 | Comienzo. Creo carpetas para ir guardando las cosas                          |   |       |
| [2020-03-30 lun] | 03:00 | S1. Comienzo notas y semana 1.                                               |   |       |
| [2020-04-04 sáb] | 05:30 | S1. Model and cost function, Parameter learning.                             |   |       |
| [2020-04-05 dom] | 01:20 | S1. Algebra review.                                                          |   |       |
| [2020-04-06 lun] | 01:10 | S2. Multivariate linear regression hasta Feature scaling                     |   |       |
| [2020-04-08 mié] | 02:30 | S2. Mv. linear regression y Computing parameters analitically                |   |       |
| [2020-04-09 jue] | 01:00 | S2: Octave/Matlab tutorial.                                                  |   |       |
| [2020-04-11 sáb] | 04:00 | S2: Programming assignment: linear regression.                               |   |       |
| [2020-04-14 mar] | 02:00 | S2: Completo notas.                                                          |   |       |
| [2020-04-16 jue] | 02:00 | S3. Classification and representation.                                       |   |       |
| [2020-04-17 vie] | 02:00 | S3. Classification and representation. Decision boundary.                    |   |       |
| [2020-04-17 vie] | 00:40 | S2. Pienso en Feature scaling.                                               |   |       |
| [2020-04-17 vie] | 00:20 | S3. Logistic regression model.                                               |   |       |
| [2020-04-18 sáb] | 01:30 | S2. Reviso notas y sigo pensando en feature scaling.                         |   |       |
| [2020-04-18 sáb] | 01:10 | S3. Logistic regression model.                                               |   |       |
| [2020-04-18 sáb] | 00:30 | S3. Multiclass classification. Review.                                       |   |       |
| [2020-04-18 sáb] | 02:00 | S3. Solving the problem of overfitting.                                      |   |       |
| [2020-04-19 dom] | 03:30 | S3. Programming assignment y completo notas.                                 |   |       |
| [2020-04-21 mar] | 01:40 | S4. Review cosas S3. S4: Motivations, Neural Networks                        |   |       |
| [2020-04-22 mié] | 00:40 | S4. Model representation II, Examples and intuitions.                        |   |       |
| [2020-04-23 jue] | 00:30 | S4. Examples and intuitions. Multiclass classification. Quiz.                |   |       |
| [2020-04-24 vie] | 01:30 | S4. Programming assignment: multiclass classification & NN                   |   |       |
| [2020-04-26 dom] | 02:30 | S5. Cost function and backpropagation.                                       |   |       |
| [2020-04-28 mar] | 00:45 | S5. Backpropagation intuition.                                               |   |       |
| [2020-04-29 mié] | 01:15 | S5. Backpropagation in practice.                                             |   |       |
| [2020-04-30 jue] | 00:30 | S5. Putting it together.                                                     |   |       |
| [2020-05-01 vie] | 03:00 | S5. Programming assignment: NN learning.                                     |   |       |
| [2020-05-03 dom] | 00:45 | S5. Programming assignment: NN learning. Notas.                              |   |       |
| [2020-05-04 lun] | 01:10 | S6. Evaluating a learning algorithm.                                         |   |       |
| [2020-05-05 mar] | 01:00 | S6. Bias vs variance.                                                        |   |       |
| [2020-05-08 vie] | 00:15 | S6. Bias vs variance.                                                        |   |       |
| [2020-05-09 sáb] | 00:30 | S6. Bias vs variance.                                                        |   |       |
| [2020-05-09 sáb] | 03:30 | S6. Programming assignment: Regularized linear regression and bias/variance. |   |       |
| [2020-05-09 sáb] | 01:10 | S6. Building a spam classifier. Handling skewed data. Using large datasets.  |   |       |
| [2020-05-10 dom] | 00:30 | S6. Using large datasets. Review.                                            |   |       |
| [2020-05-11 lun] | 01:00 | S7. Large margin classification.                                             |   |       |
| [2020-05-12 mar] | 01:20 | S7. Large margin classification. Kernels.                                    |   |       |
| [2020-05-13 mié] | 00:40 | S7. Kernels. Using an SVM.                                                   |   |       |
| [2020-05-16 sáb] | 00:30 | S7. Using an SVM.                                                            |   |       |
| [2020-05-16 sáb] | 02:00 | S7. Programming assignment: SVMs                                             |   |       |
| [2020-05-23 sáb] | 01:30 | S8. Clustering                                                               |   |       |
| [2020-05-23 sáb] | 00:45 | S8. Dimensionality reduction. Motivation. PCA.                               |   |       |
| [2020-05-24 dom] | 02:30 | S8. PCA. Programming assignment.                                             |   |       |
| [2020-05-25 lun] | 01:10 | S8. Programming assignment: K-means clustering and PCA.                      |   |       |
| [2020-05-26 mar] | 01:00 | S9. Density estimation.                                                      |   |       |
| [2020-05-27 mié] | 02:00 | S9. Anomaly detection. Multivariate gaussian.                                |   |       |
| [2020-05-30 sáb] | 03:00 | S9. Predicting movie ratings. Collaborative filtering.                       |   |       |
| [2020-06-02 mar] | 01:30 | S9. Programming assignment: anomaly detection and recommender systems.       |   |       |
| [2020-06-03 mié] | 00:30 | S9. Programming assignment: anomaly detection and recommender systems.       |   |       |
| [2020-06-03 mié] | 00:10 | S10. Learning with large datasets.                                           |   |       |
| [2020-06-04 jue] | 00:30 | S10. Stochastic gradient descent.                                            |   |       |
| [2020-06-05 vie] | 00:40 | S10. Online learning.                                                        |   |       |
| [2020-06-06 sáb] | 00:45 | S10. Map reduce and data parallelism. Review.                                |   |       |
| [2020-06-08 lun] | 00:30 | S11. OCR. Sliding windows.                                                   |   |       |
| [2020-06-10 mié] | 01:20 | S11. Getting lots of data. Ceiling analysis. Quiz. Conclusion.               |   |       |
| [2020-06-12 vie] | 01:30 | Formateo y puesta en línea.                                                  |   |       |
|------------------+-------+------------------------------------------------------------------------------+---+-------|
|                  | 81:10 |                                                                              |   |       |
#+TBLFM: $2=vsum(@2..@-1);U


